var newVersion = {
    "SrcJu":"0.2",
    "hint": "聚阅2.0，重新起航",
    "JYUpdateRecords": [{
        title: "beta V0.3",
        records: [
            "优化：切源列表支持记忆选择分组和完善",
            "优化：分组选择改为分类+分组模式",
            "优化：二级分享给无接口用户逻辑完善",
            "修复：分组切源和选择分组不匹配问题",
            "修复：接口列表编辑中存在的一些bug",
            "修复：我的书架页面加载错误的问题",
            "新增：内置图片灰度和压缩，支持自定义比例"
        ]
    },{
        title: "2025/06/07 V0.2",
        records: [
            "优化：去除接口索引的版本号设定",
            "优化：切源列表增加分组筛选菜单",
            "优化：完善收藏列表动态更新最新",
            "新增：小程序版本和代码版本升级检测",
            "新增：支持小说、漫画调用下载器下载",
            "新增：源接口新增编辑菜单增加测试按钮",
            "修复：快速切换分组无法调用对应主页问题",
            "修复：软件搜索入参判断导致返回为空的问题"
        ]
    },{
        title: "2025/06/02 V0.1",
        records: [
            "重构：聚阅2.0，重新起航",
            "重构：分离接口索引和接口规则文件",
            "重构：增加接口时间戳做为接口id",
            "重构：接口分类做为类型，支持按自定义分组",
            "重构：支持云口令导入确认页",
            "重构：界面布局重新规划，代码逻辑优化",
            "重构：使用GM插件，将采用方法全局化"
        ]
    }]
};