var newVersion = {
    "SrcJu":"0.3",
    "hint": "聚阅2.0，重新起航",
    "JYUpdateRecords": [{
        title: "beta V0.4",
        records: [
            "新增：主页搜索框支持临时切换模式",
            "新增：管理菜单增加切换选源插件",
            "优化：二级视频类型扩展搜索优化完善"
        ]
    },{
        title: "2025/06/13 V0.3",
        records: [
            "优化：切源列表支持记忆选择分组和完善",
            "优化：获取分组列表改为分类+分组模式",
            "优化：二级分享给无接口用户逻辑完善",
            "优化：接口分组支持多标签用,号分隔",
            "优化：获取接口规则代码，按场景返回",
            "修复：分组切源和选择分组不匹配问题",
            "修复：接口列表编辑中存在的一些bug",
            "修复：我的书架页面加载错误的问题",
            "修复：二级接口代码写入extra导致崩溃的问题",
            "新增：内置图片灰度和压缩，可调缩小和质量",
            "新增：主页搜索框增加输入空格调用历史记录"
        ]
    },{
        title: "2025/06/07 V0.2",
        records: [
            "优化：去除接口索引的版本号设定",
            "优化：切源列表增加分组筛选菜单",
            "优化：完善收藏列表动态更新最新",
            "新增：小程序版本和代码版本升级检测",
            "新增：支持小说、漫画调用下载器下载",
            "新增：源接口新增编辑菜单增加测试按钮",
            "修复：快速切换分组无法调用对应主页问题",
            "修复：软件搜索入参判断导致返回为空的问题"
        ]
    },{
        title: "2025/06/02 V0.1",
        records: [
            "重构：聚阅2.0，重新起航",
            "重构：分离接口索引和接口规则文件",
            "重构：增加接口时间戳做为接口id",
            "重构：接口分类做为类型，支持按自定义分组",
            "重构：支持云口令导入确认页",
            "重构：界面布局重新规划，代码逻辑优化",
            "重构：使用GM插件，将采用方法全局化"
        ]
    }]
};