var newVersion = {
    "SrcJu":"0.1",
    "hint": "聚阅2.0，重新起航",
    "JYUpdateRecords": [{
        title: "beta V0.2",
        records: [
            "优化：去除接口索引的版本号设定",
            "新增：小程序版本和代码版本升级检测",
            "修复：快速切换分组无法调用对应主页问题"
        ]
    },{
        title: "2025/06/02 V0.1",
        records: [
            "重构：聚阅2.0，重新起航",
            "重构：分离接口索引和接口规则文件",
            "重构：增加接口时间戳做为接口id",
            "重构：接口分类做为类型，支持按自定义分组",
            "重构：支持云口令导入确认页",
            "重构：界面布局重新规划，代码逻辑优化",
            "重构：使用GM插件，将采用方法全局化"
        ]
    }]
};