var newVersion = {
    "SrcJu": "0.7",
    "hint": "聚阅2.0，重新起航",
    "JYUpdateRecords": [{
        title: "beta V0.8",
        records: [
            "修复：避免小说模式下将非选集的页面组件带进去报错",
            "修复：二级页面进入收藏书架菜单无沉浸模式问题",
            "优化：接口编辑页面下测试按钮增加长按调用开发助手",
            "优化：主页切源列表分组选择逻辑调整强化记忆分组",
            "优化：主页切源列表选项增加长按菜单(分享、禁用等)"
        ]
    },{
        title: "2025/07/11 V0.7",
        records: [
            "修复：二级页面读取缓存因时间判断错误的问题",
            "修复：幻灯片进入二级收藏后，在书架被刷新图片的问题",
            "优化：主题图标设置页面优化，支持本地图标，感谢顺佬",
            "优化：主题颜色选择逻辑完善，接口列表批量选择美化",
            "新增：书架增加聚阅收藏逻辑，二级界面长按封面加入",
            "新增：新增加入聚阅收藏方法，支持自定义一二级加入",
            "新增：聚阅二级页面封面对象支持优先二级返回detailObj",
            "升级：更新L佬弹窗插件，嗅觉浏览器支持hikerPop切源",
            "升级：小程序版本3，优化启动逻辑，避免出错"
        ]
    },{
        title: "2025/06/28 V0.6",
        records: [
            "修复：搜索记录数从高到低未截取记录数据的问题",
            "修复：静态分类fyall，主页无翻页时未setResult",
            "修复：二级选集标题名称修整判断错误的问题",
            "修复：二级切源列表未显示最新章节问题extar.desc",
            "优化：搜索历史改为文件记录最大100条，可设置显示数",
            "优化：二级列表动态解析和分页动态解析支持parse",
            "优化：二级列表获取为空时，改为加载页面显示",
            "新增：管理中心增加聚阅开发手册说明文档入口",
            "新增：管理中心增加主题图标设置及相关页面逻辑完善"
        ]
    },{
        title: "2025/06/22 V0.5",
        records: [
            "修复：搜索页、频道页改用子页面修复足迹问题",
            "优化：频道页面、导入确认页界面美化，主题颜色",
            "优化：选源列表切换分组时动态显示列表数量",
            "优化：接口编辑，代码保存后同步索引作者和版本",
            "优化：接口编辑页逻辑调整，代码保存后加强提醒",
            "优化：测试模式下支持频道页面正常打开访问",
            "优化：二级选集列表样式改为默认自动判断选择",
            "新增：频道、搜索页对接顺佬新H5沉浸图显示",
            "新增：管理中心规则配置增加不显示沉浸图开关",
            "新增：长按切源增加快速禁用当前源入口",
            "升级：小程序升级版本2，增加子页面"
        ]
    },{
        title: "2025/06/18 V0.4",
        records: [
            "新增：主页搜索框支持临时切换模式",
            "新增：管理菜单增加切换选源插件",
            "新增：静态分类修复并增加自定义颜色属性",
            "新增：增加开放聚合搜索新页面搜索方式",
            "优化：二级视频类型扩展搜索优化完善",
            "优化：主界面搜索历史和结果样式美化",
            "优化：收藏获取最新执行预处理并始终输出源名",
            "修复：无二级一级直接解析的无搜索结果问题"
        ]
    },{
        title: "2025/06/13 V0.3",
        records: [
            "优化：切源列表支持记忆选择分组和完善",
            "优化：获取分组列表改为分类+分组模式",
            "优化：二级分享给无接口用户逻辑完善",
            "优化：接口分组支持多标签用,号分隔",
            "优化：获取接口规则代码，按场景返回",
            "修复：分组切源和选择分组不匹配问题",
            "修复：接口列表编辑中存在的一些bug",
            "修复：我的书架页面加载错误的问题",
            "修复：二级接口代码写入extra导致崩溃的问题",
            "新增：内置图片灰度和压缩，可调缩小和质量",
            "新增：主页搜索框增加输入空格调用历史记录"
        ]
    },{
        title: "2025/06/07 V0.2",
        records: [
            "优化：去除接口索引的版本号设定",
            "优化：切源列表增加分组筛选菜单",
            "优化：完善收藏列表动态更新最新",
            "新增：小程序版本和代码版本升级检测",
            "新增：支持小说、漫画调用下载器下载",
            "新增：源接口新增编辑菜单增加测试按钮",
            "修复：快速切换分组无法调用对应主页问题",
            "修复：软件搜索入参判断导致返回为空的问题"
        ]
    },{
        title: "2025/06/02 V0.1",
        records: [
            "重构：聚阅2.0，重新起航",
            "重构：分离接口索引和接口规则文件",
            "重构：增加接口时间戳做为接口id",
            "重构：接口分类做为类型，支持按自定义分组",
            "重构：支持云口令导入确认页",
            "重构：界面布局重新规划，代码逻辑优化",
            "重构：使用GM插件，将采用方法全局化"
        ]
    }]
};